Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: Suppose you want to add the Rack library (a Ruby web server gateway interface) to your project, possibly maintain your own changes to it, but continue to merge in upstream changes.
es: Suponiendo, por ejemplo, que se desea añadir la biblioteca Rack (un interface Ruby de pasarela de servidor web) al proyecto en que se está trabajando. Posiblemente con algunas personalizaciones, pero sin perder la capacidad de fusionar nuestros cambios con la evolución de la biblioteca original.

source: The maintainer adds the contributor’s repo as a remote and merges locally.
es: La gestora añade como remoto el repositorio de la colaboradora y fusiona (merge) los cambios localmente.

source: Insert 18333fig0518.png Figure 5-18.
es: Insert 18333fig0518.png Figura 5-18.

source: You can also use git apply to see if a patch applies cleanly before you try actually applying it — you can run `git apply --check` with the patch:
es: Tambien puedes utilizar 'git apply' para comprobar si un parche se puede incorporar limpiamente; antes de intentar incorporarlo. Puedes lanzar el comando 'git apply --check':

source: You branched a topic branch (`server`) to add some server-side functionality to your project, and made a commit.
es: Has ramificado a una rama puntual ('server') para añadir algunas funcionalidades al proyecto, y luego has confirmado los cambios.

source: To see which branches are already merged into the branch you’re on, you can run `git branch –merged`:
es: Si deseas ver las ramas que han sido fusionadas en la rama activa, puedes lanzar el comando 'git branch --merged':

source: The status of the simplegit.rb file is interesting.
es: La línea correspondiente al estado del archivo simplegit.rb es bastante interesante.

source: You have to shell onto the server each time, and there is no access control — everyone in the file has read and write access to every project.
es: Tienes que iniciar sesión en el servidor cada vez. Y, ademas, no tienes control de acceso --todo el mundo presente en el archivo tiene permisos de lectura y escritura a todos y cada uno de los proyectos--.

source: First, you’ll use this technique to solve one of the most annoying problems known to humanity: version-controlling Word documents.
es: En el primero de ellos, utilizarás esta técnica para resolver uno de los problemas más engorrosos conocidos por la humanidad: el control de versiones en documentos Word.

source: GitHub project header information.
es: Información de cabecera de un proyecto GitHub.

source: This is basically the `git log` command, but by default it prints out only the SHA-1 values and no other information.
es: Este comando es básicamente el mismo que 'git log', pero por defecto, imprime solo los valores SHA-1 y nada más.

source: ### Basic Merge Conflicts ###
es: ### Principales conflictos que pueden surgir en las fusiones ###

source: To get a reference that isn’t a fast-forward, you either have to rebase past a commit you’ve already pushed up or try pushing a different local branch up to the same remote branch.
es: Para tener una referencia que no sea de avance-rápido, tienes que haber reorganizado (rebase) una confirmación de cambios (commit) ya enviada anteriormente, o tienes que estar tratando de enviar una rama local distinta sobre la misma rama remota.

source: Check the tree created by that commit, and you see something interesting:
es: Revisando el árbol creado por esta última confirmación de cambios, verás algo interesante:

source: ## Remote Branches ##
es: ## Ramas Remotas ##

source: `experiment..master` shows you everything in `master` not reachable from `experiment`:
es: `experiment..master` muestra todo lo que haya en 'master' pero que no es alcanzable desde 'experiment':

source: Centralized workflow.
es: Flujo de trabajo centralizado.

source: All the examples are written as shell scripts, with some Perl thrown in, but any properly named executable scripts will work fine — you can write them in Ruby or Python or what have you.
es: Todos los ejemplos se han escrito como scripts de shell, con algo de código Perl embebido en ellos. Pero cualquier tipo de script ejecutable que tenga el nombre adecuado puede servir igual de bien --los puedes escribir en Ruby o en Python o en cualquier lenguaje de scripting con el que trabajes--.

source: To switch to an existing branch, you run the `git checkout` command.
es: Para saltar de una rama a otra, tienes que utilizar el comando 'git checkout'.

source: Because the commit pointed to by the branch you merged in was directly upstream of the commit you’re on, Git moves the pointer forward.
es: Git ha movido el apuntador hacia adelante, ya que la confirmación apuntada en la rama donde has fusionado estaba directamente "aguas arriba" respecto de la confirmación actual.

source: Clone a repository, and base some work on it.
es: Clonar un repositorio y trabajar sobre él.

source: You’ll likely need to change that to whatever your stable, published branch is.
es: Si lo vas a utilizar, tendrás que modificarlo para que se ajuste al nombre que tenga tu rama publicada.

source: In this case, you had a clean working directory when you tried to apply the stash, and you tried to apply it on the same branch you saved it from; but having a clean working directory and applying it on the same branch aren’t necessary to successfully apply a stash.
es: En este ejemplo se han aplicado los cambios de vuelta sobre un espacio de trabajo limpio, en la misma rama. Pero no es esta la única situación en la que se pueden reaplicar cambios.

source: The contributor sends the maintainer an e-mail asking them to pull changes.
es: Esta persona colaboradora envia a la gestora un correo-e solicitándole recupere e integre los cambios.

source: It’s used to pull in topic branches (short-lived branches, like your earlier `iss53` branch) when they’re ready, to make sure they pass all the tests and don’t introduce bugs.
es: También es habitual el incorporarle (pull) ramas puntuales (ramas temporales, como la rama 'iss53' del anterior ejemplo) cuando las completamos y estamos seguros de que no van a introducir errores.

source: Notice the 160000 mode for the rack entry.
es: Notese el modo 160000 para la entrada `rack`.

source: The output for this command is a little confusing.
es: El resultado de este comando es un poco confuso.

source: Topic branches, however, are useful in projects of any size.
es: Las ramas puntuales, en cambio, son útiles en proyectos de cualquier tamaño.

source: That is probably the simplest workflow, but it’s problematic if you’re dealing with larger repositories or projects.
es: Este es probablemente el flujo de trabajo más sencillo. Pero puede dar problemas cuando estás tratando con grandes repositorios o grandes proyectos.

source: As discussed in Chapter 2, there are two types of tags: annotated and lightweight.
es: Tal y como se ha comentado en el capítulo 2, hay dos tipos de etiquetas: las anotativas y las ligeras.

source: However, it’s an interesting exercise and can in theory help you avoid a rebase that you might later have to go back and fix.
es: De todas formas, es un ejercicio interesante. Y, en teoria al menos, pude ayudarte a evitar reorganizaciones que luego tengas de hechar para atras y arreglarlas.

source: The sequence for the workflow you saw here is something like Figure 5-15.
es: La secuencia del flujo de trabajo que hemos visto es algo así como lo mostrado en la Figura 5-15.

source: Oops — you didn’t want to add a huge tarball to your project.
es: !Ouch!, --no querias añadir un archivo tan grande a tu proyecto--.

source: Although tons of options are available, I’ll only cover the few that either are commonly used or can significantly affect your workflow.
es: Aunque hay multitud de ellas, aquí vamos a ver solamente unas pocas. Las mas comunmente utilizadas o las que afectan significativamente a tu forma de trabajar.

source: But it’s possible that the patch won’t apply cleanly.
es: Pero también podría suceder que el parche no se pudiera incorporar limpiamente.

source: Insert 18333fig0601.png Figure 6-1.
es: Insert 18333fig0601.png Figura 6-1.

source: If the QA team wants to push their `master` branch to `qa/master` on the remote server, they can run
es: Si alguien del equipo QA quiere enviar su rama `master` a la ubicación `qa/master` en el servidor remoto, puede lanzar algo asi como:

source: Because it generally uses a static HTTP server to serve all the data, a normal Apache server can serve thousands of files per second on average — it’s difficult to overload even a small server.
es: Por utilizar normalmente un servidor HTTP estático, un servidor Apache estandar puede con un tráfico de miles de archivos por segundo; siendo dificil de sobrecargar incluso con el más pequeño de los servidores.

source: Let’s make a few changes and commit again:
es: Haz algunos cambios más y confirmalos:

source: If your contribution came from a Git user who set up their own repository, pushed a number of changes into it, and then sent you the URL to the repository and the name of the remote branch the changes are in, you can add them as a remote and do merges locally.
es: Si recibes una contribución de un usuario que ha preparado su propio repositorio, ha guardado unos cuantos cambios en este, y luego te ha enviado la URL del repositorio y el nombre de la rama remota donde se encuentran los cambios. Puedes añadir dicho repositorio como un remoto y fusionar los cambios localmente.

source: Insert 18333fig0322.png Figure 3-22.
es: Insert 18333fig0322.png Figura 3-22.

source: A number of options can help you set the coloring to your preference.
es: Hay unos cuantos parámetros que te pueden ayudar a configurar tus colores favoritos.

source: The blob is now a different blob, which means that although you added only a single line to the end of a 400-line file, Git stored that new content as a completely new object:
es: El objeto binario es ahora un binario completamente diferente. Aunque solo has añadido una única línea al final de un archivo que ya contenia 400 líneas, Git ha almacenado el resultado como un objeto completamente nuevo.

source: The number of randomly hashed objects needed to ensure a 50% probability of a single collision is about 2^80 (the formula for determining collision probability is `p = (n(n-1)/2) * (1/2^160))`.
es: El número de objetos, codificados aleatóriamente, necesarios para asegurar un 50% de probabilidad de darse una sola colisión es cercano a 2^80 (la fórmula para determinar la probabilidad de colisión es `p = (n(n-1)/2) * (1/2^160))`).

source: You’ll also need to set the Unix user group of the `/opt/git` directories to `www-data` so your web server can read-access the repositories, because the Apache instance running the CGI script will (by default) be running as that user:
es: Asimismo, has de ajustar el grupo Unix de las carpetas bajo '/opt/git' a 'www-data', para que tu servidor web tenga acceso de lectura a los repositorios contenidos en ellas; porque la instancia de Apache que maneja los scripts CGI trabaja bajo dicho usuario:

source: The benevolent dictator’s repository serves as the reference repository from which all the collaborators need to pull.
es: El repositorio del dictador benevolente es el repositorio de referencia, del que recuperan (pull) todos los colaboradores.

source: You can enforce policy on the server side to reject pushes of commits that don’t conform to some policy, but it’s entirely up to the developer to use these scripts on the client side.
es: Puedes implantar reglas en el lado servidor para rechazar envios (push) que no cumplan ciertos estandares, pero es completamente voluntario para los desarroladores el utilizar scripts en el lado cliente.

source: Let’s look at an example of how rebasing work that you’ve made public can cause problems.
es: Vamos a verlo con un ejemplo.

source: Let’s say you’ve set up a server called `git.example.com` that you have SSH access to, and you want to store all your Git repositories under the `/opt/git` directory.
es: Supongamos que has preparado un servidor denominado 'git.example.com', con acceso SSH. Y que quieres guardar todos los repositorios Git bajo la carpeta '/opt/git'.

source: For example, in the history listed earlier, `HEAD~3` would be
es: Por ejemplo, en la historia de proyecto citada anteriormente, `HEAD~3` sería:

source: It shows you that the 'scott' user — the user with whose public key you initialized Gitosis — is the only one who has access to the `gitosis-admin` project.
es: Indicando que el usuario 'scott' --el usuario con cuya clave pública se ha inicializado Gitosis-- es el único con acceso al proyecto 'gitosis-admin'.

source: If there are none, then it was a fast-forward push; otherwise, you deny it:
es: Si hay alguna, entonces es un envio de avance-rápido (fast-forward push); sino hay ninguna, es un envio a prohibir:

source: In this case, you have a couple of administrators, some documentation writers with access to the `doc` directory, and one developer who only has access to the `lib` and `tests` directories, and your ACL file looks like this:
es: Por ejemplo, si tienes un par de administradores, algunos redactores técnicos con acceso a la carpeta 'doc', y un desarrollador que únicamente accede a las carpetas 'lib' y 'test', el archivo ACL resultante seria:

source: You did a few commits on them and deleted them directly after merging them into your main branch.
es: Has hecho unas pocas confirmaciones de cambio en ellas, y luego las has borrado tras fusionarlas con la rama principal.

source: In this section, you’ll cover how to accomplish these very useful tasks so that you can make your commit history look the way you want before you share it with others.
es: En esta sección, se verá cómo realizar todas esas útiles tareas. De tal forma que se pueda dejar el historial de cambios exactamente tal y como se desee. Eso sí, siempre antes de compartirlo con otros desarrolladores.

source: For now, you’ve committed all your changes, so you can switch back to your master branch:
es: Por ahora, como tenemos confirmados todos los cambios, podemos saltar a la rama 'master' sin problemas:

source: Let’s see what it might look like when two developers start to work together with a shared repository.
es: Vamos a ver como actuarian dos desarrolladores trabajando conjuntamente en un repositorio compartido.

source: You just switched back to your `master` branch, and you pull the `rack` branch into the `rack` subdirectory of your `master` branch of your main project:
es: Con ello, se retorna sobre la rama `master` y se recupera (pull) la rama `rack_branch` en la subcarpeta `rack` de la rama `master` del proyecto principal:

source: ### The Git Protocol ###
es: ### El Protocolo Git ###

source: You’ve partially staged this file.
es: Es decir, se ha pasado parcialmente ese archivo al área de preparación.

source: In either case, after `fetch-pack` connects, `upload-pack` sends back something like this:
es: En cualquier caso, después de establecer conexión, `upload-pack` responderá:

source: After that come the line number and the content of the file.
es: Detras, vienen el número de línea y el contendido de la línea propiamente dicha.

source: Insert 18333fig0404.png Figure 4-4.
es: Insert 18333fig0404.png Figura 4-4.

source: If a user SSHs into a server and has write access to the `/opt/git/my_project.git` directory, they will also automatically have push access.
es: Y cualquier usuario SSH que tenga acceso de escritura a la carpeta '/opt/git/my_project.git', tendrá también automáticamente acceso de volcado (push).

source: If you want to check out what GitWeb would look like for your project, Git comes with a command to fire up a temporary instance if you have a lightweight server on your system like `lighttpd` or `webrick`.
es: Si quieres comprobar cómo podría quedar GitWeb con tu proyecto, Git dispone de un comando para activar una instancia temporal, si en tu sistema tienes un servidor web ligero, como por ejemplo 'lighttup' o 'webrick'.

source: For instance, if you want to see all commits that are reachable from `refA` or `refB` but not from `refC`, you can type one of these:
es: Por ejemplo, si se deseean ver todas las confirmaciones de cambio alcanzables desde la 'refA' o la 'refB', pero no desde la 'refC', se puede teclear algo como esto:

source: Instead of writing your own Atom-generating code, you decide to use a library.
es: En lugar de escribir código propio para generar los feeds Atom, se decide emplear una biblioteca ya existente.

source: However, in order to do any collaboration in Git, you’ll need to have a remote Git repository.
es: Pero, para poder colaborar, necesitarás tener un repositorio remoto de Git.

source: in the Git source code.
es: lanzado sobre el código fuente de Git.

source: Insert 18333fig0311.png Figure 3-11.
es: Insert 18333fig0311.png Figura 3-11.

source: ## Generating Your SSH Public Key ##
es: ## Generando tu clave pública SSH ##

source: With Git, you don’t have to deploy your fix along with the `iss53` changes you’ve made, and you don’t have to put a lot of effort into reverting those changes before you can work on applying your fix to what is in production.
es: Usando Git, no necesitas mezclar el nuevo problema con los cambios que ya habias realizado sobre el problema #53; ni tampoco perder tiempo revirtiendo esos cambios para poder trabajar sobre el contenido que está en producción.

source: Git moves them around as bookmarks to the last known state of where those branches were on those servers.
es: Git las utiliza solamente como marcadores al último estado conocido de cada rama en cada servidor remoto declarado.

source: Git comes with a CGI script called GitWeb that is commonly used for this.
es: Git trae un script CGI, denominado GitWeb, que es el que usaremos para este propósito.

source: In order to initially set up any Git server, you have to export an existing repository into a new bare repository — a repository that doesn’t contain a working directory.
es: El primer paso para preparar un servidor Git, es exportar un repositorio existente a un nuevo repositorio básico, a un repositorio sin carpeta de trabajo.

source: Now that your filter is ready, you can test it by setting up a file with your `$Date$` keyword and then setting up a Git attribute for that file that engages the new filter:
es: Una vez preparado el filtro, puedes comprobar su funcionamiento preparando un archivo que contenga la clave '$Date$' e indicando a Git cual es el atributo para reconocer ese tipo de archivo:

source: ### Data Recovery ###
es: ### Recuperación de datos ###

source: In this case, two stashes were done previously, so you have access to three different stashed works.
es: En este ejemplo, se habian realizado dos guardados rápidos anteriores, por lo que se ven tres grupos de cambios guardados en la pila.

source: In this case, when you commit files that match `*.c`, Git will run them through the indent program before it commits them and then run them through the `cat` program before it checks them back out onto disk.
es: En este ejemplo, cuando confirmes cambios (commit) en archivos con extensión '*.c', Git los pasará previamente a través del programa 'indent' antes de confirmarlos, y los pasará a través del programa 'cat' antes de extraerlos de vuelta al disco.

source: Furthermore, you want your collaborators to be able to access the repository even if your computer is offline — having a more reliable common repository is often useful.
es: Es más, si deseas que tus colaboradores puedan acceder a tu repositorio, incluso cuando tu ordenador este apagado, puede ser de gran utilidad disponer de un repositorio común fiable.

source: It generally takes a lot longer to clone or fetch from the repository, and you often have a lot more network overhead and transfer volume over HTTP than with any of the other network protocols.
es: Suele requerir mucho más tiempo el clonar o el recuperar (fetch), debido a la mayor carga de procesamiento y al mayor volumen de transferencia que se da sobre HTTP respecto de otros protocolos de red.

source: To get a diff between what you have in your `rack` subdirectory and the code in your `rack_branch` branch — to see if you need to merge them — you can’t use the normal `diff` command.
es: Para ver las diferencias entre el contenido de la subcarpeta `rack` y el código en la rama `rack_branch` --para comprobar si es necesario fusionarlas--, no se puede emplear el comando `diff` habitual.

source: If someone opens that tarball, they get the latest snapshot of your project under a project directory.
es: Quien abra ese archivo tarball, obtendrá la más reciente imagen de tu proyecto; puesta bajo una carpeta de proyecto.

source: You can run the `count-objects` command to quickly see how much space you’re using:
es: Puedes utilizar el comando `count-objects` para revisar rápidamente el espacio utilizado:

source: When you notice issues, you should be able to easily figure out what commit introduced them, when, and by whom.
es: Cuando se detectan problemas, se necesita tener la capacidad de localizar facilmente la confirmación de cambios en que fueron introducidos.

source: So, let’s change this line in your `/etc/passwd` file
es: Así pues, cambia esta línea en tu archivo '/etc/passwd':

source: The original commit message for this functionality gives a simple example of running all your C source code through the `indent` program before committing.
es: El mensaje de confirmación para esta funcionalidad nos da un ejemplo simple: el de pasar todo tu código fuente C por el programa'indent' antes de almacenarlo.

source: No more branch on your server.
es: La rama en el servidor ha desaparecido.

source: One way is to use the `git fsck` utility, which checks your database for integrity.
es: Un camino es utilizando el comando de chequeo de integridad de la base de datos: `git fsck`.

source: You’ll see how to store a blob object — in this case, the string "what is up, doc?" — interactively in the Ruby scripting language.
es: Te mostraré el proceso de guardar un objeto binario grande (blob), --en este caso la cadena de texto "what is up, doc?" (¿qué hay de nuevo, viejo?)--, interactivamente, en el lenguaje de script Ruby.

source: Technically, you can do that by explicitly figuring out the common ancestor and then running your diff on it:
es: Técnicamente, lo puedes hacer descubriendo tu mismo dicho ancestro común y lanzando la comprobación de diferencias respecto de él:

source: Insert 18333fig0325.png Figure 3-25.
es: Insert 18333fig0325.png Figura 3-25.

source: If you want to push from your laptop when you’re at home, you have to mount the remote disk, which can be difficult and slow compared to network-based access.
es: Por ejemplo, si quieres enviar (push) desde tu portátil cuando estás en casa, primero tienes que montar el disco remoto; lo cual puede ser dificil y lento, en comparación con un acceso basado en red.

source: The next hook to run when applying patches via `git am` is `pre-applypatch`.
es: El siguiente punto de enganche que se activa al aplicar parches con 'git am' es el punto 'pre-applypatch'.

source: Final commit history.
es: Registro final de confirmaciones de cambio.

source: The branch histories have diverged.
es: Los registros de las ramas divergen.

source: When you’re finished, you should run `git bisect reset` to reset your HEAD to where you were before you started, or you’ll end up in a weird state:
es: Al terminar la revisión, es obligatorio teclear el comando `git bisect reset` para devolver HEAD al punto donde estaba antes de comenzar todo el proceso de búsqueda. So pena de dejar el sistema en un estado inconsistente.
